categories=[
           {level1:"レディース",level1_children:[
                                               {level2:"トップス",level2_children:["Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツ/ブラウス(半袖/袖なし)", "シャツ/ブラウス(七分/長袖)", "ポロシャツ", "キャミソール", "タンクトップ", "ホルターネック", "ニット/セーター", "チュニック", "カーディガン/ボレロ", "アンサンブル", "ベスト/ジレ", "パーカー", "トレーナー/スウェット", "ベアトップ/チューブトップ", "ジャージ", "その他"]},
                                               {level2:"ジャケット/アウター",level2_children:["テーラードジャケット", "ノーカラージャケット", "Gジャン/デニムジャケット", "レザージャケット", "ダウンジャケット", "ライダースジャケット", "ミリタリージャケット", "ダウンベスト", "ジャンパー/ブルゾン", "ポンチョ", "ロングコート", "トレンチコート", "ダッフルコート", "ピーコート", "チェスターコート", "モッズコート", "スタジャン", "毛皮/ファーコート", "スプリング", "コート", "スカジャン", "その他"]},
                                               {level2:"パンツ",level2_children:["デニム/ジーンズ", "ショートパンツ", "カジュアルパンツ", "ハーフパンツ", "チノパン", "ワークパンツ/カーゴパンツ", "クロップドパンツ", "サロペット/オーバーオール", "オールインワン", "サルエルパンツ", "ガウチョパンツ", "その他"]},
                                               {level2:"スカート",level2_children:["ミニスカート", "ひざ丈スカート", "ロングスカート", "キュロット", "その他"]},
                                               {level2:"ワンピース",level2_children:["ミニワンピース", "ひざ丈ワンピース", "ロングワンピース", "その他"]},
                                               {level2:"靴",level2_children:["ハイヒール/パンプス", "ブーツ", "サンダル", "スニーカー", "ミュール", "モカシン", "ローファー/革靴", "フラットシューズ/バレエシューズ", "長靴/レインシューズ", "その他"]},
                                               {level2:"ルームウェア/パジャマ",level2_children:["パジャマ", "ルームウェア"]},
                                               {level2:"レッグウェア",level2_children:["ソックス", "スパッツ/レギンス", "ストッキング/タイツ", "レッグウォーマー", "その他"]},
                                               {level2:"帽子",level2_children:["ニットキャップ/ビーニー", "ハット", "ハンチング/ベレー帽", "キャップ", "キャスケット", "麦わら帽子", "その他"]},
                                               {level2:"バッグ",level2_children:["ハンドバッグ", "トートバッグ", "エコバッグ", "リュック/バックパック", "ボストンバッグ", "スポーツバッグ", "ショルダーバッグ", "クラッチバッグ", "ポーチ/バニティ", "ボディバッグ/ウェストバッグ", "マザーズバッグ", "メッセンジャーバッグ", "ビジネスバッグ", "旅行用バッグ/キャリーバッグ", "ショップ袋", "和装用バッグ", "かごバッグ", "その他"]},
                                               {level2:"アクセサリー",level2_children:["ネックレス", "ブレスレット", "バングル/リストバンド", "リング", "ピアス(片耳用)", "ピアス(両耳用)", "イヤリング", "アンクレット", "ブローチ/コサージュ", "チャーム", "その他"]},
                                               {level2:"ヘアアクセサリー",level2_children:["ヘアゴム/シュシュ", "ヘアバンド/カチューシャ", "ヘアピン", "その他"]},
                                               {level2:"小物",level2_children:["長財布", "折り財布", "コインケース/小銭入れ", "名刺入れ/定期入れ", "キーケース", "キーホルダー", "手袋/アームカバー", "ハンカチ", "ベルト", "マフラー/ショール", "ストール/スヌード", "バンダナ/スカーフ", "ネックウォーマー", "サスペンダー", "サングラス/メガネ", "モバイルケース/カバー", "手帳", "イヤマフラー", "傘", "レインコート/ポンチョ", "ミラー", "タバコグッズ", "その他"]},
                                               {level2:"時計",level2_children:["腕時計(アナログ)", "腕時計(デジタル)", "ラバーベルト", "レザーベルト", "金属ベルト", "その他"]},
                                               {level2:"ウィッグ/エクステ",level2_children:["前髪ウィッグ", "ロングストレート", "ロングカール", "ショートストレート", "ショートカール", "その他"]},
                                               {level2:"浴衣/水着",level2_children:["浴衣", "着物", "振袖", "長襦袢/半襦袢", "水着", "セパレート水着", "ワンピース水着", "スポーツ用", "その他"]},
                                               {level2:"スーツ/フォーマル/ドレス",level2_children:["スカートスーツ上下", "パンツスーツ上下", "ドレス", "パーティーバッグ", "シューズ", "ウェディング", "その他"]},
                                               {level2:"マタニティ",level2_children:["トップス", "アウター", "インナー", "ワンピース", "パンツ/スパッツ", "スカート", "パジャマ", "授乳服", "その他"]},
                                               {level2:"その他",level2_children:["コスプレ", "下着", "その他"]}
                                              ]
           },
           {level1:"メンズ",level1_children:[
                                               {level2:"トップス",level2_children:["Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツポロシャツ", "タンクトップ", "ニット/セーター", "パーカーカーディガンスウェットジャージ", "ベストその他"]},
                                               {level2:"ジャケット/アウター",level2_children:["テーラードジャケット", "ノーカラージャケット", "Gジャン/デニムジャケット", "レザージャケット", "ダウンジャケット", "ライダースジャケット", "ミリタリージャケット", "ナイロンジャケットフライトジャケットダッフルコート", "ピーコート", "ステンカラーコートトレンチコート", "モッズコート", "チェスターコート", "スタジャン", "スカジャン", "ブルゾンマウンテンパーカーダウンベスト", "ポンチョ", "カバーオールその他"]},
                                               {level2:"パンツ",level2_children:["デニム/ジーンズ", "ワークパンツ/カーゴパンツ", "スラックスチノパン", "ショートパンツ", "ペインターパンツサルエルパンツ", "オーバーオールその他"]},
                                               {level2:"靴",level2_children:["スニーカー", "サンダル", "ブーツ", "モカシン", "ドレス/ビジネス長靴/レインシューズ", "デッキシューズその他"]},
                                               {level2:"バッグ",level2_children:["ショルダーバッグ", "トートバッグ", "ボストンバッグ", "リュック/バックパック", "ウエストポーチボディーバッグドラムバッグビジネスバッグ", "トラベルバッグメッセンジャーバッグ", "エコバッグ", "その他"]},
                                               {level2:"スーツ",level2_children:["スーツジャケットスーツベストスラックスセットアップその他"]},
                                               {level2:"帽子",level2_children:["キャップハット", "ニットキャップ/ビーニー", "ハンチング/ベレー帽", "キャスケット", "サンバイザーその他"]},
                                               {level2:"アクセサリー",level2_children:["ネックレス", "ブレスレット", "バングル/リストバンド", "リング", "ピアス(片耳用)", "ピアス(両耳用)", "アンクレット", "その他"]},
                                               {level2:"小物",level2_children:["長財布", "折り財布", "マネークリップコインケース/小銭入れ", "名刺入れ/定期入れ", "キーケース", "キーホルダー", "ネクタイ手袋ハンカチ", "ベルト", "マフラーストールバンダナネックウォーマー", "サスペンダー", "ウォレットチェーンサングラス/メガネ", "モバイルケース/カバー", "手帳", "ストラップネクタイピンカフリンクスイヤマフラー", "傘", "レインコート", "ミラー", "タバコグッズ", "その他"]},
                                               {level2:"時計",level2_children:["腕時計(アナログ)", "腕時計(デジタル)", "ラバーベルト", "レザーベルト", "金属ベルト", "その他"]},
                                               {level2:"水着",level2_children:["一般水着スポーツ用アクセサリーその他"]},
                                               {level2:"レッグウェア",level2_children:["ソックス", "レギンス/スパッツレッグウォーマー", "その他"]},
                                               {level2:"アンダーウェア",level2_children:["トランクスボクサーパンツその他"]},
                                               {level2:"その他",level2_children:[""]}
                                              ]
           },
           {level1:"ベビー・キッズ",level1_children:[
                                               {level2:"ベビー服(女の子用) ~95cm",level2_children:["トップスアウターパンツスカートワンピースベビードレスおくるみ下着/肌着パジャマロンパースその他"]},
                                               {level2:"ベビー服(男の子用) ~95cm",level2_children:["トップスアウターパンツおくるみ下着/肌着パジャマロンパースその他"]},
                                               {level2:"ベビー服(男女兼用) ~95cm",level2_children:["トップスアウターパンツおくるみ下着/肌着パジャマロンパースその他"]},
                                               {level2:"キッズ服(女の子用) 100cm~",level2_children:["コートジャケット/上着トップス(Tシャツ/カットソー)トップス(トレーナー)トップス(チュニック", ")トップス(タンクトップ", ")トップス(その他)スカートパンツワンピースセットアップパジャマフォーマル/ドレス和服浴衣", "甚平水着その他"]},
                                               {level2:"キッズ服(男の子用) 100cm~",level2_children:["コートジャケット/上着トップス(Tシャツ/カットソー)トップス(トレーナー)トップス(その他)パンツセットアップパジャマフォーマル/ドレス和服浴衣", "甚平水着その他"]},
                                               {level2:"キッズ服(男女兼用) 100cm~",level2_children:["コートジャケット/上着トップス(Tシャツ/カットソー)トップス(トレーナー)トップス(その他)ボトムスパジャマその他"]},
                                               {level2:"キッズ靴",level2_children:["スニーカー", "サンダル", "ブーツ", "長靴その他"]},
                                               {level2:"子ども用ファッション小物",level2_children:["靴下/スパッツ", "帽子", "エプロン", "サスペンダー", "タイツ", "ハンカチ", "バンダナ", "ベルト", "マフラー", "傘", "手袋", "スタイ", "バッグ", "その他"]},
                                               {level2:"おむつ/トイレ/バス",level2_children:["おむつ用品","おまる/補助便座","トレーニングパンツ","ベビーバス","お風呂用品","その他"]},
                                               {level2:"外出/移動用品",level2_children:["ベビーカー抱っこひも/スリング", "チャイルドシートその他"]},
                                               {level2:"授乳/食事",level2_children:["ミルクベビーフードベビー用食器その他"]},
                                               {level2:"ベビー家具/寝具/室内用品",level2_children:["ベッド布団/毛布イスたんすその他"]},
                                               {level2:"おもちゃ",level2_children:["おふろのおもちゃがらがらオルゴールベビージム手押し車/カタカタ知育玩具その他"]},
                                               {level2:"行事/記念品",level2_children:["お宮参り用品お食い初め用品アルバム手形/足形その他"]},
                                               {level2:"その他",level2_children:["母子手帳用品","その他"]}
                                              ]
           },
           {level1:"インテリア・住まい・小物",level1_children:[
                                               {level2:"キッチン/食器",level2_children:["食器調理器具収納/キッチン雑貨弁当用品カトラリー(スプーン等)テーブル用品容器エプロンアルコールグッズ浄水機その他"]},
                                               {level2:"ベッド/マットレス",level2_children:["セミシングルベッドシングルベッドセミダブルベッドダブルベッドワイドダブルベッドクイーンベッドキングベッド脚付きマットレスベッドマットレスすのこベッドロフトベッド/システムベッド簡易ベッド/折りたたみベッド収納付きその他"]},
                                               {level2:"ソファ/ソファベッド",level2_children:["ソファセットシングルソファラブソファトリプルソファオットマンコーナーソファビーズソファ/クッションソファローソファ/フロアソファソファベッド応接セットソファカバーリクライニングソファその他"]},
                                               {level2:"椅子/チェア",level2_children:["一般スツールダイニングチェアハイバックチェアロッキングチェア座椅子折り畳みイスデスクチェアその他"]},
                                               {level2:"机/テーブル",level2_children:["こたつカウンターテーブルサイドテーブルセンターテーブルダイニングテーブル座卓/ちゃぶ台アウトドア用パソコン用事務机/学習机その他"]},
                                               {level2:"収納家具",level2_children:["リビング収納キッチン収納玄関/屋外収納バス/トイレ収納本収納本/CD/DVD収納洋服タンス/押入れ収納電話台/ファックス台ドレッサー/鏡台棚/ラックケース/ボックスその他"]},
                                               {level2:"ラグ/カーペット/マット",level2_children:["ラグカーペットホットカーペット玄関/キッチンマットトイレ/バスマットその他"]},
                                               {level2:"カーテン/ブラインド",level2_children:["カーテンブラインドロールスクリーンのれんその他"]},
                                               {level2:"ライト/証明",level2_children:["蛍光灯/電球天井照明フロアスタンドその他"]},
                                               {level2:"寝具",level2_children:["布団/毛布枕シーツ/カバーその他"]},
                                               {level2:"インテリア小物",level2_children:["ごみ箱ウェルカムボードオルゴールクッションクッションカバースリッパラックティッシュボックスバスケット/かごフォトフレームマガジンラックモビール花瓶灰皿傘立て小物入れ置時計掛時計/柱時計鏡(立て掛け式)鏡(壁掛け式)置物風鈴植物/観葉植物その他"]},
                                               {level2:"季節/年中行事",level2_children:["正月成人式バレンタインデーひな祭り子どもの日母の日父の日サマーギフト/お中元夏/夏休みハロウィン敬老の日七五三お歳暮クリスマス冬一般その他"]},
                                               {level2:"その他",level2_children:[""]}
                                              ]
           },
           {level1:"本・音楽・ゲーム",level1_children:[
                                               {level2:"本",level2_children:["文学/小説人文/社会ノンフィクション/教養地図/旅行ガイドビジネス/経済健康/医学コンピュータ/IT趣味/スポーツ/実用住まい/暮らし/子育てアート/エンタメ洋書絵本参考書その他"]},
                                               {level2:"漫画",level2_children:["全巻セット少年漫画少女漫画青年漫画女性漫画同人誌その他"]},
                                               {level2:"雑誌",level2_children:["アート/エンタメ/ホビーファッションニュース/総合趣味/スポーツその他"]},
                                               {level2:"CD",level2_children:["邦楽洋楽アニメクラシックK-POP/アジアキッズ/ファミリーその他"]},
                                               {level2:"DVD/ブルーレイ",level2_children:["外国映画日本映画アニメTVドラマミュージックお笑い/バラエティスポーツ/フィットネスキッズ/ファミリーその他"]},
                                               {level2:"レコード",level2_children:["邦楽洋楽その他"]},
                                               {level2:"テレビゲーム",level2_children:["家庭用ゲーム本体家庭用ゲームソフト携帯用ゲーム本体携帯用ゲームソフトPCゲームその他"]}
                                              ]
           },
           {level1:"おもちゃ・ホビー・グッズ",level1_children:[
                                               {level2:"おもちゃ",level2_children:["キャラクターグッズぬいぐるみ小物/アクセサリー模型/プラモデルミニカートイラジコンプラモデルホビーラジコン鉄道模型その他"]},
                                               {level2:"タレントグッズ",level2_children:["アイドルミュージシャンタレント/お笑い芸人スポーツ選手その他"]},
                                               {level2:"コミック/アニメグッズ",level2_children:["ストラップキーホルダー", "バッジカードクリアファイルポスタータオルその他"]},
                                               {level2:"トレーディングカード",level2_children:["遊戯王マジック：ザ・ギャザリング", "ポケモンカードゲームデュエルマスターズバトルスピリッツプリパラアイカツカードファイト!! ヴァンガードヴァイスシュヴァルツプロ野球オーナーズリーグベースボールヒーローズドラゴンボールスリーブその他"]},
                                               {level2:"フィギュア",level2_children:["コミック/アニメ特撮ゲームキャラクターSF/ファンタジー/ホラーアメコミスポーツミリタリーその他"]},
                                               {level2:"楽器/器材",level2_children:["エレキギターアコースティックギターベースエフェクターアンプ弦楽器管楽器鍵盤楽器打楽器和楽器楽譜/スコアレコーディング/PA機器DJ機器DTM/DAWその他"]},
                                               {level2:"コレクション",level2_children:["武具使用済切手/官製はがき旧貨幣/金貨/銀貨/記念硬貨印刷物ノベルティグッズその他"]},
                                               {level2:"ミリタリー",level2_children:["トイガン個人装備その他"]},
                                               {level2:"美術品",level2_children:["陶芸ガラス漆芸金属工芸絵画/タペストリ版画彫刻/オブジェクト書写真その他"]},
                                               {level2:"アート用品",level2_children:["画材額縁その他"]},
                                               {level2:"その他",level2_children:["トランプ/UNOカルタ/百人一首ダーツビリヤード麻雀パズル/ジグソーパズル囲碁/将棋オセロ/チェス人生ゲーム野球/サッカーゲームスポーツ三輪車/乗り物ヨーヨー模型製作用品鉄道航空機アマチュア無線パチンコ/パチスロその他"]}
                                              ]
           },
           {level1:"コスメ・香水・美容",level1_children:[
                                               {level2:"ベースメイク",level2_children:["ファンデーション化粧下地コントロールカラーBBクリームCCクリームコンシーラーフェイスパウダートライアルセット/サンプルその他"]},
                                               {level2:"メイクアップ",level2_children:["アイシャドウ口紅リップグロスリップライナーチークフェイスカラーマスカラアイライナーつけまつげアイブロウペンシルパウダーアイブロウ眉マスカラトライアルセット/サンプルメイク道具/化粧小物美顔用品/美顔ローラーその他"]},
                                               {level2:"ネイルケア",level2_children:["ネイルカラーカラージェルネイルベースコート/トップコートネイルアート用品ネイルパーツネイルチップ/付け爪手入れ用具除光液その他"]},
                                               {level2:"香水",level2_children:["香水(女性用)香水(男性用)ユニセックスボディミストその他"]},
                                               {level2:"スキンケア/基礎化粧品",level2_children:["化粧水/ローション乳液/ミルク美容液フェイスクリーム洗顔料クレンジング/メイク落としパック/フェイスマスクジェル/ゲルブースター/導入液アイケアリップケアトライアルセット/サンプル洗顔グッズその他"]},
                                               {level2:"ヘアケア",level2_children:["シャンプートリートメントコンディショナーリンススタイリング", "剤カラーリング", "剤ブラシその他"]},
                                               {level2:"ボディケア",level2_children:["オイル/クリームハンドクリームローション日焼け止め/サンオイルボディソープ入浴剤制汗/デオドラントフットケアその他"]},
                                               {level2:"オーラルケア",level2_children:["口臭防止/エチケット用品歯ブラシその他"]},
                                               {level2:"リラクゼーション",level2_children:["エッセンシャルオイル芳香器お香/香炉キャンドルリラクゼーショングッズその他"]},
                                               {level2:"ダイエット",level2_children:["ダイエット食品エクササイズ用品体重計体脂肪計その他"]},
                                               {level2:"その他",level2_children:["健康用品看護/介護用品救急/衛生用品その他"]}
                                              ]
           },
           {level1:"家電・スマホ・カメラ",level1_children:[
                                               {level2:"スマートフォン/化粧品",level2_children:["スマートフォン本体バッテリー/充電器携帯電話本体PHS本体その他"]},
                                               {level2:"スマホアクセサリー",level2_children:["Android用ケースiPhone用ケースカバーイヤホンジャックストラップフィルム自撮り棒その他"]},
                                               {level2:"PC/タブレット",level2_children:["タブレットノートPCデスクトップ型PCディスプレイ電子ブックリーダーPC周辺機器PCパーツその他"]},
                                               {level2:"カメラ",level2_children:["デジタルカメラビデオカメラレンズ(単焦点)レンズ(ズーム)フィルムカメラ防犯カメラその他"]},
                                               {level2:"テレビ/映像機器",level2_children:["テレビプロジェクターブルーレイレコーダーDVDレコーダーブルーレイプレーヤーDVDプレーヤー映像用ケーブルその他"]},
                                               {level2:"オーディオ機器",level2_children:["ポータブルプレーヤーイヤフォンヘッドフォンアンプスピーカーケーブル/シールドラジオその他"]},
                                               {level2:"美容/健康",level2_children:["ヘアドライヤーヘアアイロン美容機器電気シェーバー電動歯ブラシその他"]},
                                               {level2:"冷暖房/空調",level2_children:["エアコン空気清浄器加湿器扇風機除湿機ファンヒーター電気ヒーターオイルヒーターストーブホットカーペットこたつ電気毛布その他"]},
                                               {level2:"生活家電",level2_children:["冷蔵庫洗濯機炊飯器電子レンジ/オーブン調理機器アイロン掃除機エスプレッソマシンコーヒーメーカー衣類乾燥機その他"]},
                                               {level2:"その他",level2_children:["その他"]}
                                              ]
           },
           {level1:"スポーツ・レジャー",level1_children:[
                                               {level2:"ゴルフ",level2_children:["クラブウエア(男性用)ウエア(女性用)バッグシューズ(男性用)シューズ(女性用)アクセサリーその他"]},
                                               {level2:"フィッシング",level2_children:["ロッドリールルアー用品ウエア釣り糸/ラインその他"]},
                                               {level2:"自転車",level2_children:["自転車本体ウエアパーツアクセサリーバッグ工具/メンテナンスその他"]},
                                               {level2:"トレーニング/エクササイズ",level2_children:["ランニングウォーキングヨガトレーニング用品その他"]},
                                               {level2:"野球",level2_children:["ウェアシューズグローブバットアクセサリー防具練習機器記念グッズ応援グッズその他"]},
                                               {level2:"サッカー、フットサル",level2_children:["ウェアシューズボールアクセサリー記念グッズ応援グッズその他"]},
                                               {level2:"テニス",level2_children:["ラケット(硬式用)ラケット(軟式用)ウェアシューズボールアクセサリー記念グッズ応援グッズその他"]},
                                               {level2:"スノーボード",level2_children:["ボードバインディングブーツ", "(男性用)ブーツ", "(女性用)ブーツ", "(子ども用)ウエア/装備(男性用)ウエア/装備(女性用)ウエア/装備(子ども用)アクセサリーバッグその他"]},
                                               {level2:"スキー",level2_children:["板ブーツ", "(男性用)ブーツ", "(女性用)ブーツ", "(子ども用)ビンディングウエア(男性用)ウエア(女性用)ウエア(子ども用)ストックその他"]},
                                               {level2:"その他スポーツ",level2_children:["ダンス/バレエサーフィンバスケットボールバドミントンバレーボールスケートボード陸上競技ラグビーアメリカンフットボールボクシングボウリング", "その他"]},
                                               {level2:"アウトドア",level2_children:["テント/タープライト/ランタン寝袋/寝具テーブル/チェアストーブ/コンロ調理器具食器登山用品その他"]},
                                               {level2:"その他",level2_children:["旅行用品","その他"]}
                                              ]
           },
           {level1:"ハンドメイド",level1_children:[
                                               {level2:"アクセサリー(女性用)",level2_children:["ピアスイヤリング", "ネックレス", "ブレスレット", "リング", "チャーム", "ヘアゴムアンクレット", "その他"]},
                                               {level2:"ファッション/小物",level2_children:["バッグ(女性用)バッグ(男性用)財布(女性用)財布(男性用)ファッション雑貨その他"]},
                                               {level2:"アクセサリー/時計",level2_children:["アクセサリー(男性用)時計(女性用)時計(男性用)その他"]},
                                               {level2:"日用品/インテリア",level2_children:["キッチン用品家具文房具アート/写真アロマ/キャンドルフラワー/ガーデンその他"]},
                                               {level2:"趣味/おもちゃ",level2_children:["クラフト/布製品おもちゃ/人形その他"]},
                                               {level2:"キッズ/ベビー",level2_children:["ファッション雑貨スタイ/よだれかけ外出用品ネームタグその他"]},
                                               {level2:"素材/材料",level2_children:["各種パーツ生地/糸型紙/パターンその他"]},
                                               {level2:"二次創作物",level2_children:["Ingressクリエイターズ宇宙兄弟シンデレラガールズCPグッズ"]},
                                               {level2:"その他",level2_children:[""]}
                                              ]
           },
           {level1:"チケット",level1_children:[
                                               {level2:"音楽",level2_children:["男性アイドル女性アイドル韓流国内アーティスト海外アーティスト音楽フェス声優/アニメその他"]},
                                               {level2:"スポーツ",level2_children:["サッカー野球テニス格闘技/プロレス相撲/武道ゴルフバレーボールバスケットボールモータースポーツウィンタースポーツその他"]},
                                               {level2:"演劇/芸能",level2_children:["ミュージカル演劇伝統芸能落語お笑いオペラサーカスバレエその他"]},
                                               {level2:"イベント",level2_children:["声優/アニメキッズ/ファミリートークショー/講演会その他"]},
                                               {level2:"映画",level2_children:["邦画洋画その他"]},
                                               {level2:"施設利用券",level2_children:["遊園地/テーマパーク美術館/博物館スキー場ゴルフ場フィットネスクラブプールボウリング", "場水族館動物園その他"]},
                                               {level2:"優待園/割引券",level2_children:["ショッピングレストラン/食事券フード/ドリンク券宿泊券その他"]},
                                               {level2:"その他",level2_children:[""]}
                                              ]
           },
           {level1:"自動車・オートバイ",level1_children:[
                                               {level2:"自動車本体",level2_children:["国内自動車本体外国自動車本体"]},
                                               {level2:"自動車タイヤ/ホイール",level2_children:["タイヤ/ホイールセットタイヤホイールその他"]},
                                               {level2:"自動車パーツ",level2_children:["サスペンションブレーキ外装、エアロパーツライト内装品、シートステアリング", "マフラー・排気系エンジン、過給器、冷却装置クラッチ、ミッション、駆動系電装品補強パーツ汎用パーツ外国自動車用パーツその他"]},
                                               {level2:"自動車アクセサリー",level2_children:["車内アクセサリーカーナビカーオーディオ車外アクセサリーメンテナンス用品チャイルドシートドライブレコーダーレーダー探知機カタログ/マニュアルセキュリティETCその他"]},
                                               {level2:"オートバイ車体",level2_children:[""]},
                                               {level2:"オートバイパーツ",level2_children:["タイヤマフラーエンジン、冷却装置カウル、フェンダー、外装サスペンションホイールシートブレーキタンクライト、ウィンカーチェーン、スプロケット、駆動系メーター電装系ミラー", "外国オートバイ用パーツその他"]},
                                               {level2:"オートバイアクセサリー",level2_children:["ヘルメット/シールドバイクウエア/装備アクセサリーメンテナンスカタログ/マニュアルその他"]}
                                              ]
           },
           {level1:"その他",level1_children:[
                                               {level2:"まとめ売り",level2_children:[""]},
                                               {level2:"ペット用品",level2_children:["ペットフード犬用品猫用品魚用品/水草小動物用品爬虫類/両生類用品かご/おり鳥用品虫類用品その他"]},
                                               {level2:"食品",level2_children:["菓子米野菜果物調味料魚介類(加工食品)肉類(加工食品)その他 加工食品その他"]},
                                               {level2:"飲料/酒",level2_children:["コーヒーソフトドリンクミネラルウォーター茶ウイスキーワインブランデー焼酎日本酒ビール、発泡酒その他"]},
                                               {level2:"日用品/生活雑貨/旅行",level2_children:["タオル/バス用品日用品/生活雑貨洗剤/柔軟剤旅行用品防災関連グッズその他"]},
                                               {level2:"アンティーク/コレクション",level2_children:["雑貨工芸品家具印刷物その他"]},
                                               {level2:"文房具/事務用品",level2_children:["筆記具ノート/メモ帳テープ/マスキングテープカレンダー/スケジュールアルバム/スクラップファイル/バインダーはさみ/カッターカードホルダー/名刺管理のり/ホッチキスその他"]},
                                               {level2:"事務/店舗用品",level2_children:["オフィス用品一般オフィス家具店舗用品OA機器ラッピング/包装その他"]},
                                               {level2:"その他",level2_children:[""]}
                                              ]
           }
         ]
categories.each.with_index(1) do |category,i|
 level1_var="@category#{i}"                                                        #1階層の変数("@category1"等)
 level1_val= Category.create(name:"#{category[:level1]}")                          #1階層の値作成("カテゴリ　1"等)
 eval("#{level1_var} = level1_val")                                                #1階層の変数=1階層の値
   category[:level1_children].each.with_index(1) do |level1_child,j|
     level2_var="#{level1_var}_#{j}"                                               #2階層の変数("@category1-1"等)
     level2_val= eval("#{level1_var}.children.create(name:level1_child[:level2])") #2階層の値作成("カテゴリ　1-1"等)
     eval("#{level2_var} = level2_val")                                            #2階層の変数=2階層の値
       level1_child[:level2_children].each do |level2_children_val|
         eval("#{level2_var}.children.create(name:level2_children_val)")           #3階層の値作成("カテゴリ　1-1-1"等)
       end
   end
end
